app/Http/Controllers/ConduitController.php

    public function index()
    {

        // $conduits = Conduit::Join('users', 'users.id', '=', 'conduits.user_id')
        //     ->select('conduits.id', 'title', 'about', 'detail', 'tag', 'conduits.created_at', 'users.name')
        //     ->get();
        $conduits = Conduit::Join('users', 'users.id', '=', 'conduits.user_id')
            ->select('conduits.id', 'title', 'about', 'detail', 'tag', 'conduits.created_at', 'users.name')
            ->paginate(5);
---
select `conduits`.`id`, `title`, `about`, `detail`, `tag`, `conduits`.`created_at`, `users`.`name` from `conduits` inner join `users` on `users`.`id` = `conduits`.`user_id` limit 5 offset 0
select count(*) as aggregate from `conduits` inner join `users` on `users`.`id` = `conduits`.`user_id`

    public function article($id)
    {
        $conduit = Conduit::Join('users', 'users.id', '=', 'conduits.user_id')
        ->select('conduits.id', 'title', 'about', 'detail', 'tag', 'conduits.created_at', 'users.name')
        ->find($id);

        $comments = PostForm::Join('users', 'users.id', '=', 'post_forms.user_id')
        ->Join('conduits', 'conduits.id', '=', 'post_forms.article_id')
        ->select('post_forms.id', 'comment', 'post_forms.created_at', 'users.name','article_id')
        ->where('article_id', '=', $id)
        ->get();
---
select `conduits`.`id`, `title`, `about`, `detail`, `tag`, `conduits`.`created_at`, `users`.`name` from `conduits` inner join `users` on `users`.`id` = `conduits`.`user_id` where `conduits`.`id` = '3' limit 1
select `post_forms`.`id`, `comment`, `post_forms`.`created_at`, `users`.`name`, `article_id` from `post_forms` inner join `users` on `users`.`id` = `post_forms`.`user_id` inner join `conduits` on `conduits`.`id` = `post_forms`.`article_id` where `article_id` = '1'

    public function editor_id($id)
    {
        $conduit = Conduit::Join('users', 'users.id', '=', 'conduits.user_id')
        ->select('conduits.id', 'title', 'about', 'detail', 'tag', 'conduits.created_at', 'users.name')
        ->find($id);
---
select `conduits`.`id`, `title`, `about`, `detail`, `tag`, `conduits`.`created_at`, `users`.`name` from `conduits` inner join `users` on `users`.`id` = `conduits`.`user_id` where `conduits`.`id` = '1' limit 1

    public function update(Request $request, $id)
    {
        $conduit = Conduit::find($id);
---
select * from `conduits` where `conduits`.`id` = '4' limit 1

    public function destroy($id)
    {
        $conduit = Conduit::find($id);
        $conduit->delete();
---
select * from `conduits` where `conduits`.`id` = '3' limit 1
delete from `conduits` where `id` = 3

    public function comment(Request $request, $id)
    {
        PostForm::create([
            'comment' => $request->comment,
            'user_id' => $request->user_id,
            'article_id' => $id
        ]);
---
insert into `post_forms` (`comment`, `user_id`, `article_id`, `updated_at`, `created_at`) values ('aaaaaaaaaaa', '', '1', '2023-12-24 15:23:08', '2023-12-24 15:23:08')